docs/mfo/20240531080208-mfo_seminario.html
<!doctype html>
<html lang="en">
  <head>
    <meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="description" content="Personal homepage exported with org-thtml">

  <title>Seminário - Outros métodos formais</title>
  <link rel="icon" type="image/x-icon" href="/images/favicon.ico">

  <meta property="og:url" content="https://bugarela.com/mfo/20240531080208-mfo_seminario.html" />
  <meta property="og:title" content="Seminário - Outros métodos formais" />
  <meta property="og:type" content="article" />
  <meta property="og:description" content="Personal homepage exported with org-thtml" />
  
  
    <meta name="twitter:card" content="summary_large_image">
    <meta name="twitter:site" content="@bugarela">
    <meta name="twitter:title" content="Seminário - Outros métodos formais">
    <meta name="twitter:description" content="Personal homepage exported with org-thtml">
  

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/pure-min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.1/css/all.min.css">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/pure/1.0.1/grids-responsive-min.css">
<link rel="stylesheet" href="../css/layouts/style.css">

  </head>
  <body>
    <div id="layout" class="pure-g">
      <div class="sidebar pure-u-1 pure-u-md-1-3">
  <div class="pure-g">
    <div class="pure-u-1 pure-u-lg-1-2">
    </div>
    <div class="pure-u-1 pure-u-lg-1-2">
      <div class="header">
        <h2 class="brand-title"><a href="../"><i class="fas fa-home"></i> Gabriela Moreira</a></h2>
      </div>
      <div class="centered">
        <h1 class="huge"><i class="fas fa-folder-open"></i></h1>
        <h1 class="huge"><a href="./">MFO</a></h1>
        <h2 class="brand-title">Métodos Formais</h2>
        <h2 class="brand-tagline">Materiais da disciplina</h2>
      </div>
      <div class="footer">
  <div>Created using Emacs and <a href="https://github.com/juanjosegarciaripoll/org-thtml">org-mode</a></div>
</div>

    </div>
  </div>
</div>

      <div class="content pure-u-1 pure-u-md-2-3">
        <h2>Seminário - Outros métodos formais</h2>
        <a href="https://bugarela.com/mfo/slides/20240531080208-mfo_seminario.pdf">PDF</a><br />
<div id="outline-container-informa-es-importantes-1" class="outline-2">
<h2 id="informa-es-importantes-1"><span class="section-number-2">1.</span> Informações importantes</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Data de apresentação: 25 e 30 de setembro</li>
<li>Trabalho individual ou em dupla</li>
<li>Enviar slides no moodle (em PDF)</li>
<li>Tempo de apresentação: 15 minutos (dupla) ou 10 minutos (individual)</li>
</ul>
</div>
</div>
<div id="outline-container-introdu-o-1" class="outline-2">
<h2 id="introdu-o-1"><span class="section-number-2">2.</span> Introdução</h2>
<div class="outline-text-2" id="text-2">
<p>
Existe uma variedade de técnicas e ferramentas de métodos formais, e seria inviável aprender várias delas nesta disciplina. O objetivo deste seminário é explorar superficialmente outras técinas/ferramentas para a compreensão dessa variedade e das possíveis alternativas.
</p>
</div>
</div>
<div id="outline-container-sugest-es-de-t-picos-1" class="outline-2">
<h2 id="sugest-es-de-t-picos-1"><span class="section-number-2">3.</span> Sugestões de Tópicos</h2>
<div class="outline-text-2" id="text-3">
<p>
Dentro da técnica de <i>model checking</i> que temos estudado, existem várias outras ferramentas (além de TLA+ e Quint):
</p>
<ul class="org-ul">
<li>PlusCal (versão &ldquo;imperativa&rdquo; de TLA+)</li>
<li>Alloy</li>
<li>NuSMV</li>
<li>Spin</li>
<li>Redes de Petri</li>
<li>PRISM</li>
<li>Mais na <span class="underline"><a href="https://en.wikipedia.org/wiki/List_of_model_checking_tools">lista do Wikipedia</a></span></li>
</ul>

<p>
Uma técnica que já mencionamos na disciplina algumas vezes é a de assistentes de provas. Seguem algumas ferramentas:
</p>
<ul class="org-ul">
<li>Coq</li>
<li>Isabelle</li>
<li>Agda</li>
<li>Lean (brasileiro!)</li>
<li>Idris</li>
<li>Dafny</li>
<li>F*</li>
<li>Mais na <span class="underline"><a href="https://en.wikipedia.org/wiki/Proof_assistant">lista do Wikipedia</a></span></li>
</ul>

<p>
Ferramentas para verificação de programas escritos em linguagens de programação:
</p>
<ul class="org-ul">
<li>Dafny</li>
<li>Viper</li>
<li>Prusti (para Rust)</li>
<li>Gobra (para Go)</li>
<li>Nagini (para Python)</li>
</ul>

<p>
Outras técnicas (além de <i>model checking</i> e assistentes de provas):
</p>
<ul class="org-ul">
<li>Máquina de estado abstrata (<i>Abstract State Machine</i> - ASM)</li>
<li>Calculo \(\pi\) (&pi;-calculus)</li>
<li><i>Continuation Passing Style</i> (CSP)</li>
<li>Lógica de Hoare</li>
<li>Método de desenvolvimento Viena (<i>Vienna Development Method</i> - VDM)</li>
</ul>
</div>
</div>
<div id="outline-container-estrutura-1" class="outline-2">
<h2 id="estrutura-1"><span class="section-number-2">4.</span> Estrutura</h2>
<div class="outline-text-2" id="text-4">
<p>
O enfoque da apresentação deve ser a técnica/ferramenta em si: como usá-la, para que é boa, para que é ruim, em que(ais) área(s) é mais aplicada. Desejável: casos de uso (i.e. empresa X usou pra verificar Y). Indesejável: Detalhes históricos.
</p>
<ul class="org-ul">
<li>Mostre ao menos um exemplo (código/fórmula)</li>
</ul>
</div>
</div>

      </div>
    </div>
  </body>
</html>
